*** alloc/src/lib.rs:110:17: replace collections::binary_heap::BinaryHeap<T, A>::push with ()

*** mutation diff:
--- alloc/src/lib.rs
+++ replace collections::binary_heap::BinaryHeap<T, A>::push with ()
@@ -102,17 +102,17 @@
             fn new() -> BinaryHeap<T, A> {
                 BinaryHeap(
                     crate::vec::from_seq(rust_primitives::sequence::seq_empty()),
                     std::marker::PhantomData::<A>,
                 )
             }
             #[hax_lib::requires(self.len() < core::primitive::usize::MAX)]
             fn push(&mut self, v: T) {
-                self.0.push(v)
+                () /* ~ changed by cargo-mutants ~ */
             }
             #[hax_lib::ensures(|res| (self.len() > 0) == res.is_some())]
             fn pop(&mut self) -> Option<T> {
                 let mut max: Option<&T> = None;
                 let mut index = 0;
                 for i in 0..self.len() {
                     hax_lib::loop_invariant!(|i: usize| (i > 0) == max.is_some());
                     if max.is_none_or(|max| self.0[i] > *max) {

---- collections::binary_heap::tests::test_peek stdout ----

thread 'collections::binary_heap::tests::test_peek' (534725) panicked at alloc/src/lib.rs:164:13:
Test failed: assertion failed: `(left == right)` 
  left: `None`,
 right: `Some(0)` at alloc/src/lib.rs:193.
minimal failing input: elements = [
    0,
]
	successes: 0
	local rejects: 0
	global rejects: 0

---- collections::binary_heap::tests::test_push_pop stdout ----

thread 'collections::binary_heap::tests::test_push_pop' (534726) panicked at alloc/src/lib.rs:164:13:
Test failed: assertion failed: `(left == right)` 
  left: `0`,
 right: `1` at alloc/src/lib.rs:173.
minimal failing input: elements = [
    0,
]
	successes: 0
	local rejects: 0
	global rejects: 0

failures:
    collections::binary_heap::tests::test_peek
    collections::binary_heap::tests::test_push_pop

test result: FAILED. 50 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.15s

*** result: Failure(101)
